# see https://github.com/Homebrew/homebrew-bundle
cask_args appdir: "/Applications"

######################################################################
# Homebrews                                                          #
# Use 'brew list' to list all installed apps                         #
######################################################################

brew "mas"
brew "rbenv"
brew "ruby"
brew "mint"
brew "swiftformat"
brew "swiftlint"
brew "openssl"
brew "openapi-generator"
brew "jupyterlab" # Interactive Environment
# brew "imagemagick"	

######################################################################
# App-Store apps via "mas"                                           #
# Use 'mas search <search>' to find the id's                         #
# Use 'mas list' to list all installed apps                          #
######################################################################

mas "Adaptivity", id: 1054670022
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Affinity Publisher", id: 881418622
mas "Bakery - Simple Icon Creator", id: 1575220747
mas "Custom Symbols", id: 1566662030
mas "Developer", id: 640199958
mas "Divvy", id: 413857545
mas "Final Cut Pro", id: 424389933
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "RocketSim for Xcode", id: 1504940162
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
mas "AppDab", id: 1612325183
mas "Desk Remote Control", id: 1509037746
mas "MoneyMoney", id: 872698314
mas "Speedtest by Ookla", id: 1153157709
# mas "Asset Catalog Creator Pro", id: 809625456
# mas "Tweetbot 3 for Twitter", id: 1384080005
# mas "Tyme 2", id: 1063996724
# mas "1Password", id: 443987910
# mas "Apple Configurator 2", id: 1037126344
# mas "ForkLift", id: 412448059
# mas "GIF Brewery 3", id: 1081413713
# mas "Grammarly for Safari", id: 1462114288
# mas "Microsoft Remote Desktop", id: 1295203466
# mas "ToothFairy", id: 1191449274

######################################################################
# Communication                                                      #
######################################################################

cask "discord"
cask "slack"
cask "elgato-camera-hub"
cask "elgato-control-center"
cask "elgato-stream-deck"
cask "elgato-wave-link"

######################################################################
# Development                                                        #
######################################################################

cask "visual-studio-code"
cask "iterm2"
cask "proxyman"
cask "sublime-merge"
cask "sf-symbols"
cask "figma"
cask "contraste"
cask "imageoptim"
cask "google-chrome"
cask "periphery"
cask "postman"
cask "linear-linear"
cask "jupyterlab" # Desktop App
# cask "xcodes"
# cask "tower"

######################################################################
# Quick Look Plugins                                                 #
# see https://github.com/sindresorhus/quick-look-plugins             #
######################################################################

cask "provisionql"
cask "quicklook-csv"
cask "quicklook-json"
cask "qlmarkdown"
cask "qlcolorcode"
#cask "qlstephen"
#cask "qlprettypatch"
#cask "betterzipql"
#cask "qlimagesize"
#cask "webpquicklook"
#cask "suspicious-package"

######################################################################
# Productivity                                                       #
######################################################################

cask "appcleaner"
cask "raspberry-pi-imager"
# cask "notion"
# cask "monitorcontrol"
# cask "alfred"
# cask "bettertouchtool"
# cask "eul"

######################################################################
# Privacy                                                            #
######################################################################

# cask "protonvpn"
# cask "expressvpn"
# cask "little-snitch"
# cask "micro-snitch"

######################################################################
# Personal                                                           #
######################################################################

cask "autodesk-fusion360" if ENV["USER"] == "hoppsen"
cask "prusaslicer" if ENV["USER"] == "hoppsen"
cask "binance" if ENV["USER"] == "hoppsen"
# cask "lightburn" # cask missing if ENV["USER"] == "hoppsen"
