# see https://github.com/Homebrew/homebrew-bundle
cask_args appdir: "/Applications"

######################################################################
# Homebrews                                                          #
# Use 'brew list' to list all installed apps                         #
######################################################################

brew "mas"
# brew "imagemagick"
# brew "swiftformat"
# brew "swiftlint"

######################################################################
# App-Store apps via "mas"                                           #
# Use 'mas search <search>' to find the id's                         #
# Use 'mas list' to list all installed apps                          #
######################################################################

mas "Adaptivity", id: 1054670022
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Affinity Publisher", id: 881418622
mas "Developer", id: 640199958
mas "Divvy", id: 413857545
mas "Final Cut Pro", id: 424389933
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "ToothFairy", id: 1191449274
mas "Tyme 2", id: 1063996724
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
# mas "Asset Catalog Creator Pro", id: 809625456
# mas "1Password", id: 443987910
# mas "Apple Configurator 2", id: 1037126344
# mas "ForkLift", id: 412448059
# mas "GIF Brewery 3", id: 1081413713
# mas "Grammarly for Safari", id: 1462114288
# mas "Microsoft Remote Desktop", id: 1295203466

######################################################################
# Development                                                        #
######################################################################

cask "visual-studio-code"
cask "iterm2"
cask "charles"
cask "postman"
cask "sublime-merge"
cask "sf-symbols"
cask "contraste"
cask "imageoptim"
cask "google-chrome"
# cask "tower"

######################################################################
# Quick Look Plugins                                                 #
# see https://github.com/sindresorhus/quick-look-plugins             #
######################################################################

cask "provisionql"
cask "quicklook-csv"
cask "quicklook-json"
#cask "qlcolorcode"
#cask "qlstephen"
#cask "qlmarkdown"
#cask "qlprettypatch"
#cask "betterzipql"
#cask "qlimagesize"
#cask "webpquicklook"
#cask "suspicious-package"

######################################################################
# Productivity                                                       #
######################################################################

cask "appcleaner"
# cask "monitorcontrol"
# cask "alfred"
# cask "bettertouchtool"
# cask "eul"

######################################################################
# Privacy                                                            #
######################################################################

# cask "expressvpn"
# cask "little-snitch"
# cask "micro-snitch"

######################################################################
# Personal                                                           #
######################################################################

cask "spotify" if ENV["USER"] == "hoppsen"
cask "discord" if ENV["USER"] == "hoppsen"
cask "autodesk-fusion360" if ENV["USER"] == "hoppsen"
# cask "lightburn" # cask missing
